[
  "The first Christmas was celebrated on December 25, AD 336 in Rome.",
  "The first artificial Christmas Tree wasn’t a tree at all. It was created out of goose feathers that were dyed green.",
  "Electric lights for trees were first used in 1895.",
  "The first Christmas cards were vintage and invented in 1843, the Victorian Era.",
  "The first state to recognize the Christmas holiday officially was Alabama.",
  "Coca Cola was the first beverage company to use Santa for a winter promotion.",
  "Mistletoe was chosen as Oklahoma’s state flower in 1893.",
  "The first Christmas in space was in 1968.",
  "The world’s largest Christmas stocking measured 106 feet and 9 inches (32.56 m) long and 49 feet and 1 inch (14.97 m) wide. It weighed as much as five reindeer and held almost 1,000 presents. It was made by the Children’s Society in London on December 14, 2007.",
  "The world’s largest Christmas present was the Statue of Liberty. The French gave it to the US in 1886. It was 151 feet (46 m) tall and weighed 225 tons (450,000 lbs).",
  "The tallest Christmas tree ever cut was a 221-foot Douglas fir that was displayed in 1950 at the Northgate Shopping Center in Seattle, Washington.",
  "The traditional three colors of Christmas are green, red, and gold. Green has long been a symbol of life and rebirth; red symbolizes the blood of Christ, and gold represents light as well as wealth and royalty.",
  "The first Christmas celebrated in the White House was in 1889.",
  "Christmas wasn’t declared an official holiday in the United States until June 26, 1870.",
  "Christmas trees have been sold in the U.S. since 1850.",
  "The first Christmas tree retail lot in the United States was started in 1851 in New York by Mark Carr.",
  "The first printed reference to a Christmas tree was in 1531 in Germany.",
  "Christmas trees are grown in all 50 states including Hawaii and Alaska.",
  "The first Christmas tree was decorated in 1605 in Strasbourg, France.",
  "3 billion Christmas cards are sent in the U.S. each year.",
  "The first Christmas postage stamp was issued in Austria in 1937.",
  "All the gifts in the Twelve Days of Christmas would equal 364 gifts.",
  "White Christmas” by Irving Berlin is the best-selling single record of all time, with over 100 million sales, worldwide.",
  "President Teddy Roosevelt, an environmentalist, banned Christmas trees from the White House in 1901.",
  "President Franklin Pierce was the first president to decorate an official White House Christmas tree.",
  "The first eggnog in the U.S. was consumed in Captain John Smith’s Jamestown settlement in 1607. Poinsettia plants are named after Joel R. Poinsett, who brought the plant from Mexico to America in 1828.",
  "Rudolph was created by Robert L. May in 1939 to attract customers to the Montgomery Ward department store.",
  "Construction workers started the Rockefeller Center Christmas tree tradition in 1931.",
  "Christmas caroling began as an old English custom called Wassailing – toasting neighbors to a long life.",
  "The Elf on the Shelf was inspired by the creators' own toy elf, Fisbee, who they grew up with in the 1970s.",
  "The tradition of kissing under Mistletoe started in Norse mythology. Frigg, the goddess of love, promised to kiss anyone who passed under the berry-laden plant after it saved her son's life. It wasn't until the 18th century, however, that the Christmas custom picked up steam in England.",
  "The history of Santa Claus dates all the way back to the third century, to a Turkish monk named St. Nicholas who was famous for helping the poor and sick.",
  "Jingle Bells was the first song broadcast from space when Gemini 6 astronauts Tom Stafford and Wally Schirra sang it on December 16, 1965.",
  "In America, the tradition of leaving cookies and milk for Santa Claus on Christmas Eve took root during the Great Depression, when parents encouraged children to keep their charitable spirit alive in the face of financial hardship.",
  "Scientists calculated that for Santa to deliver presents to every home in the world, he would have to travel at a speed of 4,921,200 miles per hour!",
  "The holly inside a wreath actually represents Jesus’ Crown, and the red berries represent his blood.",
  "Our favorite pudding, the Christmas pudding, was initially a soup made with raisins and wine.",
  "Edward Johnson invented the first electric tree lights in 1882",
  "The word Christmas comes from the old English meaning Christ’s mass (Cristes maesse).",
  "The story of Santa’s sleigh being pulled by reindeer has been around for a while, but Rudolph only joined the gang in 1939.",
  "The gold chocolate coins we receive at Christmas are to represent the gold St Nicholas supposedly gave to the poor",
  "Milk and cookies derive from an Old Dutch tradition of leaving food for St Nicholas on feast day.",
  "Each year, approximately ten million Christmas turkeys are eaten in the U.K. and 22 million in the United States.",
  "About $1,000 is spent on Christmas gifts each year by the average American family.",
  "The Rubik Cube, the largest selling Christmas toy in 1980, sold for $1.99, but now sells for nearly $10.",
  "Twenty-eight sets of LEGOS are sold every second during the Christmas season.",
  "While shopping during the Christmas season, shoppers use their Visa cards more than six thousand times every minute.",
  "Mistletoe was an ancient symbol of virility, so someone stood under it if they were available to the opposite sex.",
  "If you are really in to recycling, you can eat your Christmas tree. The needles provide vitamin C. You can also eat pine nuts, if you tree comes with pinecones! Some Christmas trees become food for zoo animals.",
  "December 25 to January 5, referred to as “Christmastide” or “Twelve Holy Days,” is the derivation of the song “The Twelve Days of Christmas.”",
  "Denny’s restaurants in the United States originally stayed open all day and night, so their buildings were built without locks. In 1988, they decided to close on Christmas Day, but they could not lock the doors!",
  "Nearly six million dollars are spent during the holiday season on ugly Christmas sweaters.",
  "Candy canes were invented to keep kids quiet in church",
  "Instead of turkey at Christmas, it used to be a pigs head and mustard",
  "Christmas pudding used to be a soup",
  "People in Japan eat fast-food chicken on Christmas day",
  "Father Christmas is called lots of different names all around the world",
  "In Sweden, they leave a coffee for Santa instead of cookies",
  "The only light on Santa’s sleigh is Rudolph’s nose"
]